performance/metrics/CANN8.3/20260108/test_ascend_deepseek_v3.2_w8a8_1p1d_32p_in64k_out3k_30ms.txt
Image: swr.cn-southwest-2.myhuaweicloud.com/base_image/dockerhub/lmsysorg/sglang:cann8.3.rc2-a3-release20260106
deep-ep                   1.0.0+95728843.cann.8.3.rc2.b210
sgl-kernel-npu            2025.12.25
sglang                    0.5.6.post2
sglang-router             0.3.0
torch                     2.8.0+cpu
torch_npu                 2.8.0.post2.dev20251224
torchao                   0.9.0
torchvision               0.23.0
transformers              4.57.1
CANN: version=8.3.RC2
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=6688, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/DeepSeek-V3.2-Exp-W8A8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=64000, random_output_len=3000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=6688, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/DeepSeek-V3.2-Exp-W8A8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=64000, random_output_len=3000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 4096000
#Output tokens: 192000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     64        
Benchmark duration (s):                  417.50    
Total input tokens:                      4096000   
Total input text tokens:                 4096000   
Total input vision tokens:               0         
Total generated tokens:                  192000    
Total generated tokens (retokenized):    183273    
Request throughput (req/s):              0.15      
Input token throughput (tok/s):          9810.80   
Output token throughput (tok/s):         459.88    
Peak output token throughput (tok/s):    868.00    
Peak concurrent requests:                34        
Total token throughput (tok/s):          10270.68  
Concurrency:                             21.36     
Accept length:                           2.70      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   139345.71 
Median E2E Latency (ms):                 125717.76 
---------------Time to First Token----------------
Mean TTFT (ms):                          56335.81  
Median TTFT (ms):                        49040.99  
P99 TTFT (ms):                           121000.60 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.68     
Median TPOT (ms):                        24.95     
P99 TPOT (ms):                           70.64     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           27.68     
Median ITL (ms):                         24.13     
P95 ITL (ms):                            72.06     
P99 ITL (ms):                            74.31     
Max ITL (ms):                            276.58    
==================================================